# BuiltInFailures.WallJoinRoofFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures Class
BuiltInFailures Class Members See Also
---
Failures about WallJoinRoof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class WallJoinRoofFailures
```

Visual Basic
---
```text
Public NotInheritable Class WallJoinRoofFailures
```

Visual C++
---
```text
public ref class WallJoinRoofFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..WallJoinRoofFailures
# See Also
BuiltInFailures..::..WallJoinRoofFailures Members
Autodesk.Revit.DB Namespace